In [13]:
import pandas as pd

In [14]:
titanic = pd.read_csv("../../Data/titanic.csv", usecols=["survived", "pclass","sex", "age", "fare"])

In [4]:
titanic

     survived  pclass     sex   age     fare
0           0       3    male  22.0   7.2500
1           1       1  female  38.0  71.2833
2           1       3  female  26.0   7.9250
3           1       1  female  35.0  53.1000
4           0       3    male  35.0   8.0500
..        ...     ...     ...   ...      ...
886         0       2    male  27.0  13.0000
887         1       1  female  19.0  30.0000
888         0       3  female   NaN  23.4500
889         1       1    male  26.0  30.0000
890         0       3    male  32.0   7.7500

[891 rows x 5 columns]

In [5]:
titanic.groupby(by='sex').mean()

        survived    pclass        age       fare
sex
female  0.742038  2.159236  27.915709  44.479818
male    0.188908  2.389948  30.726645  25.523893

In [6]:
titanic.groupby(by='sex').sum()

        survived  pclass       age        fare
sex
female       233     678   7286.00  13966.6628
male         109    1379  13919.17  14727.2865

In [7]:
titanic.groupby(by='sex').agg(["mean", "sum", "min", "max"])

        survived                 pclass                      age            \
            mean  sum min max      mean   sum min max       mean       sum
sex
female  0.742038  233   0   1  2.159236   678   1   3  27.915709   7286.00
male    0.188908  109   0   1  2.389948  1379   1   3  30.726645  13919.17

                         fare
         min   max       mean         sum   min       max
sex
female  0.75  63.0  44.479818  13966.6628  6.75  512.3292
male    0.42  80.0  25.523893  14727.2865  0.00  512.3292

# We can add a dictionary to the agg method to specify which columns we want to apply the aggregation functions to

In [8]:
titanic.groupby(by='sex').agg(
    {
        'survived':["sum", "mean"],
        'pclass': 'mean',
        'age':['mean', 'median'],
        'fare':'max'
    }
)

       survived              pclass        age             fare
            sum      mean      mean       mean median       max
sex
female      233  0.742038  2.159236  27.915709   27.0  512.3292
male        109  0.188908  2.389948  30.726645   29.0  512.3292

# We cand create a new column with the aggregation functions.
## For new coluumns we passed a tuple with the column name and the aggregation function

In [9]:
titanic.groupby(by='sex').agg(
    survival_rate = ('survived', 'mean')
)

        survival_rate
sex
female       0.742038
male         0.188908

In [10]:
titanic.groupby(by='sex').agg(
    sum_gender_age = ('age', 'sum')
)

        sum_gender_age
sex
female         7286.00
male          13919.17

In [11]:
titanic.groupby(by='sex').agg(
    fare_sum = ('fare', 'sum')
)

          fare_sum
sex
female  13966.6628
male    14727.2865